using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace IVR.Models
{
    public enum Msgs
    {
        
        إسم_المادة_موجود_بالفعل=0,
        تم_إضافة_المادة_بنجاح=1,
        إسم_الطالب_موجود_بالفعل =2,
        تم_إضافة_الطالب_بنجاح = 3,
        تم_إضافة_الطالب_للمادة_بنجاح =4,
        إسم_المستخدم_موجود_بالفعل =5,
        تم_إضافة_المستخدم_بنجاح =6,
       نم_تعديل_الرقم_السري_بنجاح=7,
        دخول_ناجح=8,
       يوجد_خطأ_بالبريد_الالكتروني_أو_الرقم_السري=9,
       عدد_الطلاب_مكتمل=10,
       لا_يوجد_نتائج=11,
        يوجد_نتائج=12,
       تم_حذف_المادة_بنجاح=13,
       تم_حذف_الطالب_بنجاح = 14,
       نم_تعديل_بيانات_الطالب_بنجاح =15,
       تم_حذف_الطالب_من_المادة_بنجاح =16,
       تم_حذف_المستخدم_بنجاح =17,
       تم_إضافة_ميعاد_للمادة_بنجاح =18,
        هذا_الطالب_مضاف_بالفعل_لهذه_الماده=19,
        تم_حذف_ميعاد_المادة_بنجاح = 20,
        عدد_الساعات_المتاحه_لدي_الطالب_لا_تكفي=21
    }
}
